/**
  ******************************************************************************
  * @file    delay.c
  * @author  huazi
  * @version V1.0
  * @date    2018-10-11
  * @brief   标准延时函数
  ******************************************************************************
  * @attention
  *

  *
  ******************************************************************************
  */ 
  
#include "delay.h"


/**
  * @brief  提供标准延时时间
  * @param  无
  * @retval 无
  */
	
	

/*
*********************************************************************************************************
*	函 数 名: delay_us
*	功能说明: us级延时函数，要求系统时钟频率为16MHz；systick时钟固定为AHB时钟的1/8，即16/8=2MHz
*	形    参：time 需要的延时时间
*	返 回 值: 无
*********************************************************************************************************
*/
	void delay_us(uint16_t time)
	{
		uint32_t temp;
		SysTick->LOAD = 2*time;	//设置重装载值
		SysTick->CTRL = 0x01;		//使能，减到零是无动作，采用外部时钟源
		SysTick->VAL = 0x00;		//清零
		
		do
		{
			temp = SysTick->CTRL;	//读取当前倒计数值
		}
		while((temp&0x01) && (!(temp&(1<<16))));	//等待时间到达
		
		SysTick->CTRL = 0x00;		//关闭计数器
		SysTick->VAL = 0x00;		//清零计数器
	}
/*
*********************************************************************************************************
*	函 数 名: delay_ms
*	功能说明: ms级延时函数，要求系统时钟频率为16MHz；systick时钟固定为AHB时钟的1/8，即16/8=2MHz
*	形    参：time 需要的延时时间，此参数必须小于8000；LOAD为24bit寄存器，最大值为16777216
*	返 回 值: 无
*********************************************************************************************************
*/	
		void delay_ms(uint16_t time)
	{
		uint32_t temp;
		SysTick->LOAD = 2000*time;	//设置重装载值
		SysTick->VAL = 0x00;		//清零
		SysTick->CTRL = 0x01;		//使能，减到零是无动作，采用外部时钟源
		do
		{
			temp = SysTick->CTRL;	//读取当前倒计数值
		}
		while((temp&0x01) && (!(temp&(1<<16))));	//等待时间到达
		
		SysTick->CTRL = 0x00;		//关闭计数器
		SysTick->VAL = 0x00;		//清零计数器
	}
/*
*********************************************************************************************************
*	函 数 名: delay_sec
*	功能说明: sec级延时函数，要求系统时钟频率为16MHz
*	形    参：time 需要的延时时间，此参数必须小于65535
*	返 回 值: 无
*********************************************************************************************************
*/	
	void delay_sec(uint16_t time)
	{
		uint16_t i;
		for(i=0;i<time;i++)
		{
			delay_ms(1000);
		}
	}
